Catalogs/ВидыПрочихДоходовФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыПрочихДоходовФизическихЛиц</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеПрочихДоходовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаНДФЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодДоходаНДФЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоходаИсполнительногоПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИсполнительногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаСтраховыеВзносы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовПоСтраховымВзносам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодДоходаСтраховыеВзносы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыДоходовПоСтраховымВзносам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаРаздела2Расчета6НДФЛ</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтрокиРаздела2Расчета6НДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоходаИсполнительногоПроизводства2022</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИсполнительногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыНалогообложенияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыНалогообложенияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяЦеликом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяЦеликом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыДоходов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьИПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьОПВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьОППВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьСО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВОСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьООСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьЕП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьОПВР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыПрочихДоходовФизическихЛиц/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ОблагаетсяНДФЛ = 1;
		
	// ЗУПК
		СобытияФормЗУПК.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		
		ЭтаФорма.НалогообложениеНачислений.ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента");
		РедактированиеПериодическихСведений.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка);
	КонецЕсли;
	
	ПроинициализироватьФорму();
	ПолучитьПризнакиУчета(ЭтаФорма.НалогообложениеНачислений.ВидДохода);
	// ЗУПК
	
	ДатаИзмененийК353ФЗ = ЗарплатаКадрыПовтИсп.ДатаВступленияВСилуНА("ИзмененияК353ФЗ");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВидДоходаИсполнительногоПроизводства",
		"Заголовок",
		СтрШаблон(НСтр("ru = 'Вид дохода (исполнительные листы) до %1'"), Формат(ДатаИзмененийК353ФЗ,"ДЛФ=D")));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВидДоходаИсполнительногоПроизводства2022",
		"Заголовок",
		СтрШаблон(НСтр("ru = 'Вид дохода (исполнительные листы) с %1'"), Формат(ДатаИзмененийК353ФЗ,"ДЛФ=DD")));
	
	ВидыДоходовИсполнительногоПроизводстваКлиентСервер.НастроитьПолеВидДоходаДляВыплатыЗарплаты(ЭтотОбъект,ДатаИзмененийК353ФЗ - 1);
	ВидыДоходовИсполнительногоПроизводстваКлиентСервер.НастроитьПолеВидДоходаДляВыплатыЗарплаты(ЭтотОбъект,ДатаИзмененийК353ФЗ, "ВидДоходаИсполнительногоПроизводства2022"); 
	
	УстановитьДоступностьКодаДоходаНДФЛ(ЭтаФорма);
	КодДоходаНДФЛПрежнееЗначение = Объект.КодДоходаНДФЛ; 
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ЗУПК
	СобытияФормЗУПК.ПриЧтенииНаСервере(ЭтаФорма);
	// ЗУПК
	
	ОблагаетсяНДФЛ = ?(ЗначениеЗаполнено(Объект.КодДоходаНДФЛ),1,0);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ЗУПК
	ОбновитьВидимостьСпособовОбложения();
	// ЗУПК
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

// ЗУПК
&НаСервере
Процедура Подключаемый_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьНалогообложениеНачислений(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ПараметрыЗаписи.Свойство("ПроверкаПередЗаписьюВыполнена") Тогда 
		Отказ = Истина;
		ЗаписатьНаКлиенте(Ложь);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
// ЗУПК

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// ЗУПК
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	// ЗУПК
		Если ОблагаетсяНДФЛ = 1 И Не ЗначениеЗаполнено(Объект.КодДоходаНДФЛ) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Код дохода НДФЛ не заполнен.'"), , , "Объект.КодДоходаНДФЛ" , Отказ);
		КонецЕсли;
	// ЗУПК
	КонецЕсли;
	
	РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка, Отказ);
	// ЗУПК
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ЗУПК
	ВедущийОбъект = Источник;
	РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(ЭтаФорма, ВедущийОбъект, ИмяСобытия, Параметр, Источник);
	Если Параметры.Свойство("ИмяРегистра") И Параметр.ИмяРегистра = "НалогообложениеНачислений" Тогда
		ПолучитьПризнакиУчета(ЭтаФорма.НалогообложениеНачислений.ВидДохода);
		ОбновитьВидимостьСпособовОбложения();
	КонецЕсли;
	ДобавитьИнойВидДоходаВСписокВыбора(ЭтаФорма);
	// ЗУПК
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

// ЗУПК
&НаКлиенте
Процедура Подключаемый_РедактированиеИсторииНалогообложениеНачислений(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СотрудникиКлиент.ОткрытьФормуРедактированияИстории("НалогообложениеНачислений", Объект.Ссылка, ЭтаФорма);
	Иначе
		ТекстСообщения = Нстр("ru = 'Необходимо записать вид прочего дохода.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНаКлиенте(Истина);
	
КонецПроцедуры
// ЗУПК

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОблагаетсяНДФЛПриИзменении(Элемент)
	
	Если ОблагаетсяНДФЛ = 1 Тогда
		Объект.КодДоходаНДФЛ = КодДоходаНДФЛПрежнееЗначение;
	Иначе
		КодДоходаНДФЛПрежнееЗначение = Объект.КодДоходаНДФЛ;
		Объект.КодДоходаНДФЛ = Неопределено;
	КонецЕсли;
	
	УстановитьДоступностьКодаДоходаНДФЛ(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КодДоходаНДФЛПриИзменении(Элемент)
	Объект.СтрокаРаздела2Расчета6НДФЛ = УчетНДФЛКлиентПовтИсп.СтрокаРаздела2Расчета6НДФЛПоКодуДохода(Объект.КодДоходаНДФЛ);
КонецПроцедуры

// ЗУПК
#Область НалогообложениеНачислений

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийВидДоходаПриИзменении(Элемент)
	
	УстановитьСпособНалогообложенияПоУмолчанию();
	ОбновитьВидимостьСпособовОбложения();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийПериодПриИзменении(Элемент)
	
	 ЭтаФорма.НалогообложениеНачислений.Период = НачалоМесяца(ЭтаФорма.НалогообложениеНачислений.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийСпособОбложенияИПНПриИзменении(Элемент)
	
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюИПНПриИзменении(Элемент)
	
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийСпособОбложенияОПВПриИзменении(Элемент)
	
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВПриИзменении(Элемент)
	
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийСпособОбложенияВОСМСПриИзменении(Элемент)
	
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюВОСМСПриИзменении(Элемент)
	
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
	
КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийСпособОбложенияСНПриИзменении(Элемент)
	
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСНПриИзменении(Элемент)
	
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийСпособОбложенияСОПриИзменении(Элемент)
	
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСОПриИзменении(Элемент)
	
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийСпособОбложенияООСМСПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюООСМСПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийСпособОбложенияОПВРПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВРПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОбложения();
	ОбновитьОтображениеПолейВводаНалогообложенияНачислений();
КонецПроцедуры

#КонецОбласти
// ЗУПК

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКодаДоходаНДФЛ(Форма)
	
	ДоступностьКодаНДФЛ = Форма.ОблагаетсяНДФЛ = 1;
	
	Форма.Элементы.КодДоходаНДФЛ.Доступность = ДоступностьКодаНДФЛ;
	Форма.Элементы.КодДоходаНДФЛ.АвтоОтметкаНезаполненного = ДоступностьКодаНДФЛ;
	Форма.Элементы.КодДоходаНДФЛ.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Форма.Объект.КодДоходаНДФЛ);
	
КонецПроцедуры

// ЗУПК
&НаСервере
Процедура ПроинициализироватьФорму()
	
	Если ЭтаФорма.НалогообложениеНачисленийПрежняя = Неопределено Тогда
		РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка);
		ДобавитьИнойВидДоходаВСписокВыбора(ЭтаФорма);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.НалогообложениеНачисленийПрежняя.Период) Тогда
		// нет записей в регистре, нужно записать элемент
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПризнакиУчета(ВидДохода)
	
	ЭтаФорма.НалогообложениеНачисленийУчитыватьИПН	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьИПН");
	ЭтаФорма.НалогообложениеНачисленийУчитыватьВОСМС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьВОСМС");
	ЭтаФорма.НалогообложениеНачисленийУчитыватьОПВ	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьОПВ");
	ЭтаФорма.НалогообложениеНачисленийУчитыватьСО	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьСО");
	ЭтаФорма.НалогообложениеНачисленийУчитыватьСН	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьСН");
	ЭтаФорма.НалогообложениеНачисленийУчитыватьООСМС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьООСМС");
	ЭтаФорма.НалогообложениеНачисленийУчитыватьОПВР	 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьОПВР");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСпособНалогообложенияПоУмолчанию()
	
	ПолучитьПризнакиУчета(ЭтаФорма.НалогообложениеНачислений.ВидДохода);
	
	ЭтаФорма.НалогообложениеНачислений.СпособОбложенияИПН	= ?(ЭтаФорма.НалогообложениеНачисленийУчитыватьИПН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	ЭтаФорма.НалогообложениеНачислений.СпособОбложенияВОСМС	= ?(ЭтаФорма.НалогообложениеНачисленийУчитыватьВОСМС, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	ЭтаФорма.НалогообложениеНачислений.СпособОбложенияОПВ	= ?(ЭтаФорма.НалогообложениеНачисленийУчитыватьОПВ, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	ЭтаФорма.НалогообложениеНачислений.СпособОбложенияСО	= ?(ЭтаФорма.НалогообложениеНачисленийУчитыватьСО, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	ЭтаФорма.НалогообложениеНачислений.СпособОбложенияСН	= ?(ЭтаФорма.НалогообложениеНачисленийУчитыватьСН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	ЭтаФорма.НалогообложениеНачислений.СпособОбложенияООСМС = ?(ЭтаФорма.НалогообложениеНачисленийУчитыватьООСМС, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	ЭтаФорма.НалогообложениеНачислений.СпособОбложенияОПВР  = ?(ЭтаФорма.НалогообложениеНачисленийУчитыватьОПВР, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьСпособовОбложения()
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.НалогообложениеНачислений.ВидДохода) Тогда
		 ЭтаФорма.НалогообложениеНачислений.ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента");
		 УстановитьСпособНалогообложенияПоУмолчанию();
	КонецЕсли;
	 
	НеОблагаетсяЧастично = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично"); 
	
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюИПН.Видимость		= ЭтаФорма.НалогообложениеНачислений.СпособОбложенияИПН	 = НеОблагаетсяЧастично;
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВ.Видимость		= ЭтаФорма.НалогообложениеНачислений.СпособОбложенияОПВ	 = НеОблагаетсяЧастично;
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюВОСМС.Видимость	= ЭтаФорма.НалогообложениеНачислений.СпособОбложенияВОСМС = НеОблагаетсяЧастично;
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСО.Видимость		= ЭтаФорма.НалогообложениеНачислений.СпособОбложенияСО = НеОблагаетсяЧастично;
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСН.Видимость		= ЭтаФорма.НалогообложениеНачислений.СпособОбложенияСН = НеОблагаетсяЧастично;
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюООСМС.Видимость	= ЭтаФорма.НалогообложениеНачислений.СпособОбложенияООСМС = НеОблагаетсяЧастично;
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВР.Видимость	= ЭтаФорма.НалогообложениеНачислений.СпособОбложенияОПВР = НеОблагаетсяЧастично;
	
	Элементы.НалогообложениеНачисленийСпособОбложенияИПН.Видимость		= ЭтаФорма.НалогообложениеНачисленийУчитыватьИПН;
	Элементы.НалогообложениеНачисленийСпособОбложенияОПВ.Видимость		= ЭтаФорма.НалогообложениеНачисленийУчитыватьОПВ;
	Элементы.НалогообложениеНачисленийСпособОбложенияВОСМС.Видимость	= ЭтаФорма.НалогообложениеНачисленийУчитыватьВОСМС;
	Элементы.НалогообложениеНачисленийСпособОбложенияСО.Видимость		= ЭтаФорма.НалогообложениеНачисленийУчитыватьСО;
	Элементы.НалогообложениеНачисленийСпособОбложенияСН.Видимость		= ЭтаФорма.НалогообложениеНачисленийУчитыватьСН;
	Элементы.НалогообложениеНачисленийСпособОбложенияООСМС.Видимость 	= ЭтаФорма.НалогообложениеНачисленийУчитыватьООСМС;
	Элементы.НалогообложениеНачисленийСпособОбложенияОПВР.Видимость	 	= ЭтаФорма.НалогообложениеНачисленийУчитыватьОПВР;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.НалогообложениеНачислений.Период) Тогда
		ЭтаФорма.НалогообложениеНачислений.Период = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтаФорма, ИмяРегистра, ВедущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНалогообложениеНачислений(ТекущийОбъект)
	
	РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, "НалогообложениеНачислений", ТекущийОбъект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПолейВводаНалогообложенияНачислений()
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаКлиенте(ЗакрытьПослеЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.НалогообложениеНачисленийПрежняя.Период) Тогда
			ЭтаФорма.НалогообложениеНачисленийНоваяЗапись = Истина;
		КонецЕсли;
		
		Если НЕ ЭтаФорма.НалогообложениеНачисленийНоваяЗапись Тогда
			
			ИзменилсяПериод = (ЭтаФорма.НалогообложениеНачислений.Период <> ЭтаФорма.НалогообложениеНачисленийПрежняя.Период);
			ИзменилисьДанные = Ложь;
			Для Каждого Поле Из ЭтаФорма.НалогообложениеНачисленийПрежняя Цикл
				Если Поле.Ключ = "Период" Тогда
					Продолжить;
				КонецЕсли;
				ИзменилисьДанные = ЭтаФорма.НалогообложениеНачислений[Поле.Ключ] <> Поле.Значение;
				Если ИзменилисьДанные Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ИзменилисьДанные ИЛИ ИзменилсяПериод Тогда
				ОткрытьФормуПредупрежденияОбИзмененииНалогообложения(ЗакрытьПослеЗаписи);
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура("ПроверкаПередЗаписьюВыполнена", Истина);
	Если Записать(ПараметрыЗаписи) И ЗакрытьПослеЗаписи Тогда
		Закрыть();
	Иначе
		Если ЭтаФорма.НалогообложениеНачисленийНоваяЗапись Тогда
			ЭтаФорма.НалогообложениеНачисленийНоваяЗапись = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПредупрежденияОбИзмененииНалогообложения(ЗакрытьПослеИсправления = Истина, ЗаписатьДанные = Истина)
	
	ТекстКнопкиДа = НСтр("ru = 'Изменились настройки'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При редактировании Вы изменили настройки налогообложения вида прочего дохода.
					|Если Вы исправили прежнюю запись (она была ошибочной), нажмите ""Исправлена ошибка"".
					|Если у элемента изменился вид дохода с %1, нажмите ""%2""'"),
			Формат(ЭтаФорма.НалогообложениеНачислений.Период, "ДФ='д ММММ гггг ""г""'"),
			ТекстКнопкиДа);
			
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрытьПослеИсправления", ЗакрытьПослеИсправления);
	ДополнительныеПараметры.Вставить("ЗаписатьДанные", ЗаписатьДанные);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуПредупрежденияОИзмененииНалогообложенияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	РедактированиеПериодическихСведенийКлиент.ЗапроситьРежимИзмененияРегистра(ЭтотОбъект, "НалогообложениеНачислений", ТекстВопроса, ТекстКнопкиДа, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПредупрежденияОИзмененииНалогообложенияЗавершение(Отказ, ДополнительныеПараметры) Экспорт 

	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтаФорма.НалогообложениеНачисленийНоваяЗапись Тогда
		
		ЗаписатьНалогообложениеНачислений(Объект.Ссылка);

		НалогообложениеНачисленийСтруктура = Новый Структура;
		
		Для Каждого Поле Из ЭтаФорма.НалогообложениеНачисленийПрежняя Цикл
			НалогообложениеНачисленийСтруктура.Вставить(Поле.Ключ, ЭтаФорма.НалогообложениеНачислений[Поле.Ключ]);
		КонецЦикла;
		
		ЭтаФорма.НалогообложениеНачисленийПрежняя = Новый ФиксированнаяСтруктура(НалогообложениеНачисленийСтруктура);
		
	КонецЕсли;
	
	ОбновитьВидимостьСпособовОбложения();
	
	Если ДополнительныеПараметры.ЗаписатьДанные Тогда 
		ЗаписатьНаКлиенте(ДополнительныеПараметры.ЗакрытьПослеИсправления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьИнойВидДоходаВСписокВыбора(Форма)
	
	Элементы = Форма.Элементы;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элементы, "НалогообложениеНачисленийВидДохода") Тогда
		ТекущийВидДохода = Форма.НалогообложениеНачислений.ВидДохода;
		ВидДоходаСписок = Элементы.НалогообложениеНачисленийВидДохода.СписокВыбора;
		Если ВидДоходаСписок.НайтиПоЗначению(ТекущийВидДохода) = Неопределено Тогда
			ВидДоходаСписок.Добавить(ТекущийВидДохода);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// ЗУПК

#КонецОбласти
